{
    "name": "Bengal Gram",
    "general": {
        "title": "General Information",
        "Description": "Bengal gram, also known as Chana or Chickpeas, is one of the earliest cultivated legumes and remains one of the most widely grown and consumed pulses worldwide. It is commonly used in Indian cuisine and is a staple in various other regions.",
        "source": "https://en.wikipedia.org/wiki/Chickpea"
    },
    "nutritional": {
        "title": "Nutritional Information",
        "Description": "Bengal gram is rich in protein, fiber, and essential vitamins and minerals, including iron, phosphorus, and folate. A 100g serving provides approximately 364 calories, 19g of protein, 6g of fat, and 61g of carbohydrates.",
        "source": "https://www.nutritionvalue.org/Chickpeas%2C_mature_seeds%2C_raw_nutritional_value.html"
    },
    "agricultural": {
        "title": "Agricultural Information",
        "Description": "Bengal gram is a drought-tolerant crop that thrives in well-drained soil with a pH range of 5.5 to 7.5. It is typically grown in tropical and subtropical regions, with India being the largest producer. The crop is sown in the post-monsoon season and harvested after about 90-120 days.",
        "source": "https://www.agricultureinformation.com/post/guide-for-cultivating-bengal-gram-or-chickpeas/"
    },
    "culinary": {
        "title": "Culinary Information",
        "Description": "Bengal gram is versatile in the kitchen and can be used in various forms including whole seeds, split (Chana Dal), and flour (Besan). It is commonly used in curries, soups, salads, and snacks. It is also an essential ingredient in many traditional Indian dishes.",
        "source": "https://www.bbcgoodfood.com/glossary/chickpea"
    },
    "other": {
        "title": "Other Usage",
        "Description": "Apart from culinary uses, Bengal gram is also used in traditional medicine for its purported health benefits. It is believed to help in managing blood sugar levels, improving digestion, and supporting heart health. Chickpea flour is also used in skincare routines as a natural exfoliant.",
        "source": "https://www.healthline.com/nutrition/chickpeas-nutrition-benefits"
    }
}
