{
    "name": "Black Gram",
    "general": {
        "title": "General Information",
        "Description": "Black gram, also known as urad dal, is a type of legume that is widely used in Indian cuisine. It is known for its high protein content and unique, nutty flavor. Black gram is often used to make dal, dosa, and various other traditional dishes.",
        "source": "https://en.wikipedia.org/wiki/Vigna_mungo"
    },
    "nutritional": {
        "title": "Nutritional Information",
        "Description": "Black gram is rich in protein, fiber, and essential nutrients such as iron, potassium, and magnesium. A 100g serving provides approximately 347 calories, 25g of protein, 1.6g of fat, and 58.99g of carbohydrates.",
        "source": "https://www.nutritionvalue.org/Dal%2C_urad%2C_raw_nutritional_value.html"
    },
    "agricultural": {
        "title": "Agricultural Information",
        "Description": "Black gram is typically grown in tropical and subtropical regions. It prefers well-drained, loamy soil with a pH range of 6 to 7.5. The crop is usually sown in the rainy season and harvested in about 90 to 120 days.",
        "source": "https://www.agrifarming.in/urad-dal-cultivation-black-gram-guide"
    },
    "culinary": {
        "title": "Culinary Information",
        "Description": "Black gram is used in a variety of dishes, especially in South Indian and Punjabi cuisines. It is commonly used to make dal, dosa, idli, vada, and papad. It can be cooked whole or split and is often used in soups, stews, and salads.",
        "source": "https://www.bbcgoodfood.com/glossary/urad-dal"
    },
    "other": {
        "title": "Other Usage",
        "Description": "In addition to its culinary uses, black gram is known for its health benefits, including aiding digestion, improving heart health, and regulating blood sugar levels. It is also used in Ayurvedic medicine for its various therapeutic properties.",
        "source": "https://www.healthbenefitstimes.com/black-gram/"
    }
}
